a = 25
b = 'sajad'
#این یه متغیره 
#متغیر ها قابل تغییراند 
#مثلا :
#a = 2
#a = 5
#متغیر a میزانش از 2 به 5 تبدیل شد

#ما توی پایتون به عدد عا میگیم int 

a = 25
print (type(a))
#خروجی : 'int'

#عدد های اعشاری را میگن float

b = 2.5
print (type(b))
#خروجی: 'float'

#برای فهمیدن نوع متغیر از type استفاده میکنیم


#نوع دیگه string هستن که داخل "" یا '' هستن که بیشتریش برای حروف استفاده میشه
#هر چیزی که داخل '' یا "" باشه string حساب میشه فرقیق نمیکنه عدد باشه یا کلمه 

c = "sajad"
print(type(c))
#خروجی :string

#مخفف string میشه str

#خوب
#در پایتون 
#جمع = +
#ضرب = *
#تقسیم = /
#توان = **
#تقسیم باقی مانده = //
#مسوای = ==
#درصد = ٪

#برای نوشتن کوتیشن در داخل کوتیشن باید از "استفاده کرد 
#مثال 
a = 'saaaaajajajajj'ghadimi'
#اشتباه 
b = 'sajad"ghadimi'
#و میشه قبل ' \ استفاده کرد

w = 'sajad\'ghadimi'
#خروجی : sajad'ghadimi

#برای اینکه داخل جمله رفت به خط  بعدی از \n استفاده میکنیم

m = "sajad \n ghadimi"

#خروجی : 
#sajad
#ghadimi

