#امروز در مورد لیست هاست

#اولی append هستش

a = ["ali" , "mohmad" , "heidar"]
#اول اسم لیست رو صدا میزنی بعد نقطه میزاری و بعد تابع رو مینویسی 
a.append("asghae")
#کار append اینه یه استرینگی بهش میدی و ارخ لیستت ااضافه میکنه 
print(a)
#خروجی : ['ali', 'mohmad', 'heidar', 'asghae']


#بعدی extend هستش 
#برای این که بخایی یه لیست رو به لیست اضافه کنی از extend استفاده میکنی

r = ["sial" , "khiar" , "kian"]

r.extend(["hpsein" , "haan" , "mohamad"])
print(r)
#خروجی: ['sial', 'khiar', 'kian', 'hpsein', 'haan', 'mohamad']
#اگه از append برای اضافع کردن لیست به لیست استفاده کنی خروجی اینجوری میشه 
#خروجی با append: ['sial', 'khiar', 'kian', ['hpsein', 'haan', 'mohamad']]
#لیست میره داخل لیست و اضافه نمیشه


#بعدی insert 

#با insret هر کلمه ای  رو دلت بخواد میتونی هر جا بزاری
k = ["ali" , "hosein"]
k.insert(1 , "hassan")
#اول بهش گفتم کجکا بزاره بعد اون کلمه رو بهش دادم 
print(k)
#خروجی : ['ali', 'hassan', 'hosein']




#بعدی remove

#remove برای پاک کردنه

abc = ["a" , "b" , "d" , "b"]
abc.remove("b")
#در لیست اگه دو تا مث همدیگه باشن اولی رو پاک میکنه و کاری به بقیه کلمات تکراری  نداره
print(abc) 
#خروجی : ['a', 'd', 'b']
#b اول رو پاک کرد
#ولی b دمم رو پاک نکرد



#بعدی  pop هست
#کار pop اینه بهش میگی کدوم استرینگ هارو پاک کنه وبرات پاکشون میکنه
p = ["gh" , "di" , "mi"]
p.pop(0)
print(p)
#خروجی: ['di', 'mi']
#و اگر هم pop رو خالی بدی اخرین کلمه رو پاک میککنه 

l = ["j" , "p"]
l.pop()
print(l)
#خروجی : ['j'] 





#بعدیclear هست که کل لیست پاک میکنه
m = ["m" , "l" , "h" , "n" , "r" , "p"]
m.clear()
print(m) 
#خروجی : []


#بعدی index

#ازش میپرسی میگی مثلا h توی کدوم ایندکسه

hhh = ["j" , "l" , "p" , "h"]
hhh.index
print(hhh.index("h"))
#خروجی : 3

#index ها شروع پایان هم دار

rr = ["f" , "k" , "i" , "o" , "f" ]
print(rr.index("f" , 1))
#گفتیم از ایندکس 1 تا اخر بگر و ببین f  ایندکس چندمه 
#چون ما اخرش خالی دادیم  تا اخر میره میتونی اونم تغغیر بدی 
#مثال : rr.index("f" , 1 , 3)
#خوب بریم برای خروجی
print(rr)
#خروجی : 4


#بعدی count 
#کارش اینه که بهت میگه توی لیستت یه استرینگ چند بار  چرخیده یا چند تا وجود داره

uu = ["g" , "i" , "u" , "g" , " g"]

print(uu.count("g"))
print(uu)
#خروجی : 2


#بعدی sort
#کارش اینه استرینگ های داخل لیست رو به حورف a-zمیچینه

z = ["b" , "c" , "a" , "d"]
z.sort()
print(z)
#خروجی: ['a', 'b', 'c', 'd']



#بعدی reverse
#کارش اینه برعکس میکنه اینبار از z-a

n = ['a', 'b', 'c', 'd']
n.reverse()
print(n)
#خروجی : ['d', 'c', 'b', 'a']



#بعدی del
#del هم مال پاک کردنه

dg = ['d', 'c', 'b', 'a']
del dg[0:2]
print(dg)
#خروجی : ['b', 'a']

#اگه خالی بزاری از لیستو از ته ئاک میکنه و ارور میده

