#تاپل ها هم مثل لیست ها هستن
#میتونی چند مقدار رو توی یه متغییر سیو کنی
#برای ساخت تاپل باید از پرانتز استفاده کنی ()
#اگه نزاری هم اشکالی نداره
#ولی خوب پیشنهاد میشه که بزاری
#مثال 
names = 1234, "sik" , 52
print(names)
#خروجی : (1234, 'sik', 52)
uu = (588 , "sish" , "pp" , 129)
print(uu)
#خروجی : (588, 'sish', 'pp', 129)
print(type(names))
#خروجی : <class 'tuple'>

#خوب
a = (58 , "ll" , 21 , "oo")
print(a[0])
#خروجی : 58


#تاپل ها غیر قابل تتغییر اند 

#توی یه تاپل میشه یه تاپل دیگه هم ساخت.

gg = ("oo" , 47 , (78 , "ii"))
print(gg)
#خروجی : ('oo', 47, (78, 'ii'))

#وحتی میشه توش لیست هم ساخت 
pp = (20 , "yy" , (85) , ["kk" , 22])
print(pp)
#خروجی : (20, 'yy', 85, ['kk', 22])

#و حتی میشه توی لیست داخل تاپل یک تاپل دیگه ساخت
ee = (55  , [85  , ("kh")])
print(ee)
#خروجی : (55, [85, 'kh'])


#حتی تاپل خالی هم میشه گزاشت

rcc = []
ccr = ()

print(type(rcc))
print(type(ccr))
#خروجی :
#<class 'list'>
#<class 'tuple'>

#ولی ولی

rrr = ["bb"]

err = ("hhh")


print(type(rrr))
print(type(err))
#خروجی : 
#<class 'list'>
#<class 'str'>
#شما توی تاپل هر چیزی بنویسید پایتون تایپ مقدار رو چاپ میکنه ینی اگه شما توی تاپل  یه استرینگ بنویسید و تایپ  بگیری تایپ استرینگ میده نه تاپل
#اگر بخایی پایتون تایپ رو تاپل چاپ کنه باید  اخر مقدارت یه , بزاری 
fff = ("mmmmmmmmmmm" ,)
print(type(fff))
#خروجی : <class 'tuple'>

