#خوب  بریم سراغ دیکشنری

#مثال

ages = {"amir" : 11 , "sajjad" : 15 , "hafez" : 5}

#میتونی به دیکشنری مقدار جدید هم اضافه کنی 
a = {"a" : 12 , "r" : 8}
a["t"] = 9
print(a)
#خروجی : {'a': 12, 'r': 8, 't': 9}

#حتی میشه مقدار داخل دیکشنری رو هم تغییر داد

m = {"h" : 5 , "l" : 8}
m["h"] = 6
print(m)
#خروجی : {'h': 6, 'l': 8}

#و میشه مقداری رو هم پاک کرد
f = {"a" : 1 , "b" : 2 , "c" : 3}
del f["a"]
print(f)
#خروجی : {'b': 2, 'c': 3}

#خوب ما از کلید in برای پرسیدن این که ایا داخل دیکشنری من همچنین مقداری وجود دارد یا خیر

w = {"a" : 74 , "b" : 87 , "u" : 21}
print("a" in w)
#خروجی : True
#False اگر هم وجود نداشته باشه خروجی میشه

#ما از متود ایتم برای گرفتن ایتم های دیکشنری میتونسم استفاده کنیم
v = {"g" : 74 , "p" : 78}
print(v.items())
#خروجی : dict_items([('g', 74), ('p', 78)])

#مار توی دیکشنری از حلقه for  هم میتونیم استفاده کنیم

m = {"ja" : 21 , "po" : 36 , "man" : 58, "bab" :96}

for i in m.items():
    print(i)
#خروجی : 
#('ja', 21)
#('po', 36)
#('man', 58)
#('bab', 96)

#خوب اینجا i به نماینده کلیو مقدار رفت ما میتونیم برای هر دوشون نمایدنده انتخاب کنیم
q = {"g" : 20 , "l" : 9 , "d" : 7}
for v, l in q.items(): #خوب اینجا v نمایده کلیده و l نمایدنده مقداره
    print(v , l)
#خروجی :
#g 20
#l 9
#d 7
#میشه یا مقدار یا کلید تنها رو چاپ کرد









s = dict([(("h" , 42 ),("g",87))])
print(s)

#خروجی : {('h', 42): ('g', 87)}



