
#خوب مبحث جدید در در مورد ماژول ها هستش 
#به هر فایلی که پوشند .py داشته باشه میگم ماژول
#خوب حالا چجوری یک فایل دیگه رو به فایل دیگه اضاقاه کنیم 
#با کلمه کلیدی import
#مثلا من قبلا یه فایل ساختم توش پر کده و میخام بیارمش توی فایل جدید اول کلمه کلیدی ایمپورت رو مینویسی بعد اسم فایل
#دقیت کنید وقتی اسم فایل رو نوشتید کلمه کلیدی .py  نمیخاد
#مثلا من قبلا چند تا کدو نوشتم توی یه فایلی بنام one.py و میخام این فایل بیارم توی این کدم 
#روشش این جوری 
#import one
#حالا اومدو ایمپورت نکرد مشکل از مسیرشه ما باید اول مسیرشو بدیم بعد اسم فایل مثال
#مثلا فایلمون توی دکساپه
#import desktop.one
#خوب اگه بخایی به اطلاعات داخل ماژول دسترسی داشته باشی  ای از این روش اساتفداه میکنی 
# اول اسم ماژولو مینویسی بعد یه . میزاری بعد مثلا میخایی به اطلاعات فانکشن دسترسی داشته باشی فقط لازمه اسم ماژول رو بنویسی
#مثال
#import one.a aاسم فانکشنه


#این بار کلمه کلیدی from هستش 
#from برای زمانیه که از یک ماژول هزار خطب ما فقط به یه فانکشن یا تنها یه چیزی یا دوسه چیز لازم داریم از from استفاده مینکنیم
#مثلا
#from one import a
#اینجا گفتیم از ماژول one متغییر a رولازم داریم نه بقیشو

#و میتونی چن تارو هم ایمپورت کنی مثلا اگه بخایی دو تا متغیر رو ایمپورت کنی از این روش استفاده میکنی 
#from one import a, b


#یه زمانی وقتی میخاییم مثلا یک فانکشن ایمپورت کنیم و اسمش خیلی بلنده میتونیم با کلمه کلیدی as اونو کوتاه کنیم 
#مثال 
#from noe import akhmanfadatbesha as aa

#نکته : اگه بخایی ماژول تو به درستی ایمپورت بشه باید هر دو ماژولتون توی یک فایل باشه