#خب مبحث امروز در مورده file هست

#خوب یه مثال ازش بزنیم

#من قبلا یه  قایل متنی درست کردم و میخام داخلوشو ببینم

#اسم فایل = tex

#داخل فایل تکسم اینارو نوشتم
#salam
#bay
#lololoooloo

f = open ('tex.txt' , 'r')
#'r'به معنی اینع که میخام داخلوشو بخونم
#برای خروجی باد از read استفاده کنیم
print(f.read())
#خروجی:
#salam
#bay
#lololoooloo


#خب ما بعد اینکه فایل رو باز کردیم اونو میبندیم روشش
f.close()

#خب یه زمانی وسط پروژوه فراموش میکنیم ببنذیم چی کار میکنیم از این روش استفاده میکنیم

with open ('tex.txt' , 'r') as f:
    ...


#این روش هم فایلو برامون باز میکنه و خودکار برامون میبنده
#چجوری بفهمیم ؟
print(f.closed)
#میگه True یعنی بله بسته شده

#خب کار با with اینجوریه

with open ('tex.txt' , 'r') as f:
    print(f.read())

#خروجی : 
#salam
#bay
#lololoooloo

#خب ما از read برای خوندن داخلش استفاده میکنیم
#اگر فایلمون زیاد باشه و اگه بخواد کلشو بخونه سی پی یو کامپیوتر مون داغ میشه و احتمال خراب شدن داره
#پس چی کار کنیم 
#از این متود استفاده میکنیم

with open ('tex.txt' , 'r') as f:
    print(f.readlines())
#خروجی : ['salam\n', 'bay\n', 'lololoooloo']

#بعدی readline هست که خظ های اولو برات چاپ میکنه


with open ('tex.txt' , 'r') as f:
    print(f.readline())
    print(f.readline())
#الان دو خط اولو برام چاپ میکنه
#خروجی : 
#salam
#bay


#خوب اگه بخایی چن تا کاراکتر رو بخونی باید داخل پرانتز مقدار رو بدی

with open ('tex.txt' , 'r') as a:
    print(a.read(11))
#الان برام 11 کراکتر اولو چاپ میکنه
#خروجی : 
#salam
#bay
#l


#خب اینجا  tell بهمون میگه شما توی چندمین کارکترین
with open ('tex.txt' , 'r') as a:
    print(a.read(11))
    print(a.tell())

#خروجی : 11

with open ('tex.txt' , 'r') as a:
    print(a.read(3))
    print(a.read(3))
#این روش اول 3 تای اول رو چاپ میکنه باز میره ادامه 3 تای دیگه
#خروجی : 
#sal
#am


#خب ما وقتی مینویسیم 3 میره برامون از اول شروع میکنه مثلا دلم میخاد از کاراکتر 5 شروع کنه 
#چی کار کنم ؟
#از این روش لستفاده کن

with open ('tex.txt' , 'r') as a:
    a.seek(5)
    print(a.read())
#خروجی : 
#bay
#lololoooloo

#برای ویرایش یا تغییر متن از این روش استفاده میکنیم
#من یه txt جدید میسازم
#اسم = tex2.txt
#داخلش هم خالی خالی هست

#اگه بخوام داخلش چیزی بنویسیم یا تغییر بدم از این روش استفاده میکنم

with open('tex2.txt' , 'w') as v:
    v.write('hello world')
#الان داخل تکس جدیدم نوشته شده =  hello world 

#این از این
#خب این روش اگر فایل تکس تون پر متن باشه همشون رو پاک میکنه و متن جدید میده برای اینکه پاک نکنه و فقط به اخرش اضافه کنه از این رو ش استفاده میکنیم


with open('tex2.txt' , 'a') as m:
    m.write(' hello user')

#داخل تکستم : hello world hello user

#خب این روش به اخرش میچسبونه برای اینکه بره و توی یه خط دیگه بنویسه از این روش استفاده میکنیم

with open('tex2.txt' , 'a') as u:
    u.writelines(' hello user \n')
#داخل تکست : 
#helloo world
#hello user





#باید بگم که هیچی نفهمیدممممممممممممممممممممممممممممم