#خوب مبحث امروز در مورده  scope هست

#اسکوپ ها میگن اون منابعی که دارین کجا میشه ازشون استفاده کرد کجا نمیشه.

x = 10
def shwo():
    print(x)


shwo()

#خروجی : 10



#خب این تا اینجا

#الان.


e = 10
def loow():
    b = 20
    print(e)
loow()
#print(b)
#خروجی : ارور



#خب 

o = 10
def rono():
    o = 20
    print(o)

rono()
#خروجی : 20

#یه چیزی توی کد بالا o مقدارش تغییر نکرده یه متغییر جدیدی ساخته شده 

print(o)
#خروجی : 10

#خب


w = 10
def jok():
    print(w)
    w = 20
    print(w)
#jok()
#خروجی : ارور


#اگه بخایی متغییر رو تغییر بدی ایجاد نکنی و فقط تغییر بدی از این روش استفاده میکنی
#از یه کلمه کلیدی استفاده میکینی

c = 10
def dodo():
    global c
    c = 20
    print(c)
dodo()
#خروجی : 20

#خوب اینجا این کلمه کلیدی متغییر بالارو میاره داخل فانکشن و داخل فانکشن تغییر میده


# به متغییر بیرون از فانشکن میگن متغییر سراری و به متغییر داخل فانکشن میگن متغییر محلی میگن

