x = 2.5
print(round(x))
#خروجی : 2
#از اینا زیان مثلا این دستور روند عدد رو نشون میده

#string ها حروف هایی هستن کخ بین '' یا "" قرار میگیرند

a = "helo " 
b = "world"
x = a + b
print (x)
#خروجی : helo world

#وقتی میخایین کدتون طولانی نیشه و ادامه رو بری خط بعدی بعد ' \قرار بدین 
#مثال:
s = "sjad ghadimi"\
"chenar"
#خروجی : sajadghadimichenar
# از این روش هم میشه استقاده کرد
w = ('dsnnnknjkejnvejkr'
     'jvbdvbdjfvbjdvbjfv')


#وقتی میخایی داخل جمله \ بزاری ولی با n تداخل پیدا میکنه و میره خط بعدی و کدت خراب میشه
s = "my \name sajad"
#خروجی: my
#ame sajad 

#راه حلش اینه که قبل \ یه \ دیگه هم گزاشت

b = "my \\name sajad"

#خروجی : my \name sajad"

#روش دیگه اینه که قبل " یه r بزاری 

s = r"my \name sajad "

print(s) 
#خروجی : my \name sajad"

#ما برای فهمیدن تعداد کاراکتر های یک جمله یا کلمه از len استفاده میکنیم 

v = "sajadghadimichenar"

print(len(v))

#خروجی : 18

#مهم : توی برنامه نویسی شمارش از 0 شروع میشه 

#خوب ما توی یک جمله میخاییم مثلا سومین کاراکتر یک کلمه یا جمله رو چیدا کنیم از روش زیر استافاده میکنیم

m = "sajad ghadimi"

#برای پیدا کردن اولین کاراکتر باید نوشت 0 دومین 3 چهارمین 5 و ...

print(m[0])
#خروجی :s

#و همینجوری میتونیم از - برای شروع از عقب استفاده کنیم 
v = "sajadghadimichenar"
print(v[-1])
#خروجی : r

#برای شروع کرئن از یک کاراکتر و پایان در یک کاراکتر دیگه از از این روش [:]استفاذه میکنیم 

print (v[0:5])
#خروجی : sajad

#اگه بخایی چند تا چند تا بری از این روش استفاده میکنی [..:..:مثلا 2]

z = "123456789"
print (z[0:8:2])
#خروجی : 1357

#اگه بخایی از یک کاراکتر تا اخر بری باید بعد : هیچی ننویسی و اگه بخایی از یه کاراکتر تا اولش بری با قبل : هیچجی ننوسیس

g = "sajadghadimichenar"
print (g[5:])
#خروجی : ghadimichenar
print (g[:5])
#خروجی : sajad

#اگر هم هر دو رو خالی بدی از اول تار اخر برات مینویسه 

print(g[:])

#خروجی : sajadghadimichenar

#از منفی هم میشع استفاده کردن 


#string ها قابل تغییر نیستن

#یک روش هم داره 

h = "23456"
l = "1" + h

print (l)
#خروجی : 123456

