a = ["sajad", "mmd" , "asghar" , "ali"]
print (type(a))
#list 
#این یک لیسته برای ساخت لیست باید از []استفاده کنیم
#توی لیست تا دلن بخواد میتونی کلمه بنویسی 
#بین هر کلمه از لیست باید , گزاشت و از " " هم باید استفاده کرد
#همیشه یعیکن اخر اسم لیستت s  یا ها اضافه کن
print(a)
#خروجی: ["sajad", "mmd" , "asghar" , "ali"]
print(a[0])
#خروجی : sajad


n = ["mmd"]

v = n + ["ali"]

print(v)

#خروجی: ['mmd', 'ali']

#لیست ها قابل تغیرند

#روش تغییر

k = ['ali' , 'heidar']

k[1] = 'asghar'

print (k)
#خروجی : ['ali', 'asghar']


k[0:] = ['mmd' , 'mohsen']

print (k)

#خروجی: ['mmd', 'mohsen']

#برای اضافه کردن هم از append استفاده میکنیم 

g = ['a' , 'b' ]
g.append('c')
print (g)
#خروجی: ['a', 'b', 'c']


#روش پاک کردن

u = ["a" , "b" , "c" , "d"]

u[1:3] = []

print (u)
#در اینجا سومی حساب نشد 
# وقتی مینویسی 5 تا چهرمی پاک میشه بنویسی 110 صدو نهمی پاک میشه و صدو دهمی سر جاشه

#از len برای list هم میشه استفاده کرد

print(len(u))

#خروجی :2

