x = 0

while x < 10:
    print(x)
    # این یک نوع وایله 

# خروجی: 
#0
#0
#و بی نهایت 0
#علتش اینه که وایل همیشه توی کد میچرخه و هربار که میچرخه یه سفر  چاپ میکنه
#و تا زمانی که 10 از x بیشتر باشه هر بار چاپ میکنه و همیشه 10 از 0 بیشتره

x = 0

while x < 10:
    print(x)

    x = x + 1

#خروجی
#1
#2
#3
#4
#5
#6
#7
#8
#9

#چرا حلقه به پایان یافت؟ چون هربار وایل میچرخید به x 1 اضافه کرو و همینجوری چرخید و یکی اضافه کرد تا رسید بع 10

#و وقتی رسی به 10 وایستاد و اداامه نداد

#ما میتونیم با end نحوه تموم شدنسو تغییر بدیم
#مثال
g = 0

while g < 10:
    print(x , end= ', ')
    x = x + 1
    #خروچی : 
    #0, 1, 2, 3, 4, 5, 6, 7, 8, 9,

    