#if یک شرطه که بهش میگی این کارو بکن اگه نشد این کار نشد این کارو نشد این کارو و اگر هم همشون نشدن در اخر این کارو بکن

x = 17

if x > 18:
    print ('be bologh residi')
elif x == 18:
    print("taze be bologh residi")
else:
    print ("dadash be bologh naresidi")

#توی یک شرط میشه بی نهایت elif ساخت ولی فقط ازئ یه else میشه استفاده کرد فقط یکی


#توی کد نویسی گه دوتا شرط بنویسی هر شرط جداگونه خروجی میدن 


#مهم مهم مهم مهم 
#در پایتون معنی این دو تارو بدون 

#true == درست  
#false == نادرست

