for i in range(3):
    print (i)
    #خروجیش :
    #0
    #1
    #2

#رنچ برای شمار اعداد هستش خوب اوکی ؟ برای شمارش اعداد

#مثالای دیگه

for h in range (2 , 7):
    print(h)
    #خ:
    #2
    #3
    #4
    #5
    #6

#و میتونی بهش بگی چن تا چن تا برو مثال:

for e in range(0 , 7 , 2):
    print (e)
    #خروج:
    #0
    #2
    #4
    #6

#به همین اسونی

#حتی از عدد های منفی هم میشه استفاده کرد مثلا بجای 0 یا 7 از -7 استفاده کرد



#از رنج برای ساخت لیست هم میشه استفاده کرد  

print(list(range(0 , 11 , 2))) 
#خروجی : [0, 2, 4, 6, 8, 10]


#و تمام عالی بود