a = ["mmd" , "asghar" , "ali" ",heidar"]


for i in a :

    if i == "asghar":
        continue

    print(i)
#خروجی : mmd ali heidar

#خب این جا ما برای رد کردن از یک حرف از continue استفاده میکنیم که نحوه استفاده بالا است

#وقتی میخایی یه لیست رو  چاپ کنی و استرینگی رو چاپ نکنی از همین continue استفاده میکنیم

#این از این

#بعدی breake که بهش کلمه رو میدی و ازون کلمه به بعد دیکه ادامه نمیده


#مثال
b = ["mmd" , "sajjad" , "asghar" , "ali" ",heidar"]


for p in a :

    if p == "asghar":
        break

    print(p)

    #خروجی:
#mmd
#sajjad


#بعدی else
#مثال 


h = ["hi" , "by"]

for k in h:
    print(k)

else:
    print("end...")

#خروجی
#hi
#by
#end...


#اگر کدمون توسط برک قطع بشه else کار نمیکنه
#و فقط breake قطم میکنه یعنی continue نمیتونه else رو متوقف کنه


#به همین اسونی


#بریم سراغ pass

#وقتی میخایی یه حلقه یا هر چیزی دیگه رو بنویسی و فعلا باهاش کاری نداشته باشه از pass استافده مینکی 
m = ["cc" , "j"]
for d in m:
    pass

#الان این هیچ خروجی نداره و ئایتون هیچ کاری باهاش نداره و خروجی خالی میده

#ولی اگر pass رو ننویسی ارور میده 

#بجای pass از ... هم میتونی استفاده کنید

m = ["cc" , "j"]
for d in m:
    ...

#خروجی : خالی 

